public/man/man1/nix3-profile-diff-closures.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - nix3-profile-diff-closures.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - nix3-profile-diff-closures.1</h1>
    
<p><strong>Warning</strong><br>
This program is <strong>experimental</strong> and its interface is subject to change.</p>
<p>#+end_quote</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Name
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p><code class="verbatim">nix profile diff-closures</code> - show the closure difference between each
version of a profile</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Synopsis
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><code class="verbatim">nix profile diff-closures</code> [/option/…]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Examples
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<ul>
<li>Show what changed between each version of the NixOS system profile:</li>
</ul>
<pre class="example">
# nix profile diff-closures --profile /nix/var/nix/profiles/system
Version 13 -&gt; 14:
acpi-call: 2020-04-07-5.8.13 → 2020-04-07-5.8.14
aws-sdk-cpp: -6723.1 KiB
…

Version 14 -&gt; 15:
acpi-call: 2020-04-07-5.8.14 → 2020-04-07-5.8.16
attica: -996.2 KiB
breeze-icons: -78713.5 KiB
brotli: 1.0.7 → 1.0.9, +44.2 KiB
</pre>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Description
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>This command shows the difference between the closures of subsequent
versions of a profile. See <code class="verbatim">nix store</code> diff-closures for details.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Options
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<ul>
<li><code class="verbatim">--profile</code> <em>path</em>

The profile to operate on.</li>
</ul>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Logging-related options
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<ul>
<li><code class="verbatim">--debug</code>

Set the logging verbosity level to ‘debug&#39;.</li>
<li><code class="verbatim">--log-format</code> <em>format</em>

Set the format of log output; one of <code class="verbatim">raw</code>, <code class="verbatim">internal-json</code>, <code class="verbatim">bar</code> or
<code class="verbatim">bar-with-logs</code>.</li>
<li><code class="verbatim">--print-build-logs</code> / <code class="verbatim">-L</code>

Print full build logs on standard error.</li>
<li><code class="verbatim">--quiet</code>

Decrease the logging verbosity level.</li>
<li><code class="verbatim">--verbose</code> / <code class="verbatim">-v</code>

Increase the logging verbosity level.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Miscellaneous global options
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<ul>
<li><code class="verbatim">--help</code>

Show usage information.</li>
<li><code class="verbatim">--offline</code>

Disable substituters and consider all previously downloaded files
up-to-date.</li>
<li><code class="verbatim">--option</code> <em>name</em> <em>value</em>

Set the Nix configuration setting <em>name</em> to <em>value</em> (overriding
<code class="verbatim">nix.conf</code>).</li>
<li><code class="verbatim">--refresh</code>

Consider all previously downloaded files out-of-date.</li>
<li><code class="verbatim">--version</code>

Show version information.

<strong>Note</strong>

See <code class="verbatim">man nix.conf</code> for overriding configuration settings with command
line flags.</li>
</ul>
</div>
</div>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
